DROP TABLE IF EXISTS sales CASCADE;
DROP TABLE IF EXISTS products CASCADE;
DROP TABLE IF EXISTS partners CASCADE;
DROP TABLE IF EXISTS product_types CASCADE;

CREATE TABLE product_types (
    product_type_id SERIAL PRIMARY KEY,
    product_type_name VARCHAR(255) NOT NULL UNIQUE,
    product_type_coefficient NUMERIC(10,2) NOT NULL
);

CREATE TABLE products (
    product_id SERIAL PRIMARY KEY,
    product_type_name_id int,
	FOREIGN key (product_type_name_id) references product_types(product_type_id),
    product_name VARCHAR(512),
    product_sku VARCHAR(50),
    product_min_price NUMERIC(10,2)
);

CREATE TABLE partners (
    partner_id SERIAL PRIMARY KEY,
    partner_type VARCHAR(10),
    partner_name VARCHAR(255),
    partner_director VARCHAR(255),
    partner_email VARCHAR(255),
    partner_phone VARCHAR(20),
    partner_legal_address TEXT,
    partner_inn VARCHAR(12),
    partner_rating INT
);

CREATE TABLE sales (
    sale_id SERIAL PRIMARY KEY,
    sale_product_name_id int,
	foreign key (sale_product_name_id) references products(product_id),
    sale_partner_name_id INT,
	foreign key (sale_partner_name_id) references partners(partner_id),
    sale_quantity INT
);


INSERT INTO product_types (product_type_name, product_type_coefficient) VALUES
('Древесно-плитные материалы', 1.5),
('Декоративные панели', 3.5),
('Плитка', 5.25),
('Фасадные материалы', 4.5),
('Напольные покрытия', 2.17);


INSERT INTO products (product_type_name_id, product_name, product_sku, product_min_price) VALUES
(1, 'Фанера ФСФ 1800х1200х27 мм бежевая береза', '6549922', 5100.00),
(2, 'Мягкие панели прямоугольник велюр цвет оливковый 600х300х35 мм', '7018556', 1880.00),
(4, 'Бетонная плитка Белый кирпич микс 30х7,3 см', '5028272', 2080.00),
(3, 'Плитка Мозаика 10x10 см цвет белый глянец', '8028248', 2500.00),
(5, 'Ламинат Дуб Античный серый 32 класс толщина 8 мм с фаской', '9250282', 4050.00),
(2, 'Стеновая панель МДФ Флора 1440x500x10 мм', '7130981', 2100.56),
(4, 'Бетонная плитка Красный кирпич 20x6,5 см', '5029784', 2760.00),
(5, 'Ламинат Канди Дизайн 33 класс толщина 8 мм с фаской', '9658953', 3200.96),
(1, 'Плита ДСП 11 мм влагостойкая 594x1815 мм', '6026662', 497.69),
(5, 'Ламинат с натуральным шпоном Дуб Эксперт толщина 6 мм с фаской', '9159043', 3750.00),
(3, 'Плитка настенная Формат 20x40 см матовая цвет мята', '8588376', 2500.00),
(1, 'Плита ДСП Кантри 16 мм 900x1200 мм', '6758375', 1050.96),
(2, 'Стеновая панель МДФ Сосна Полярная 60х280х4мсм цвет коричневый', '7759324', 1700.00),
(4, 'Клинкерная плитка коричневая 29,8х29,8 см', '5118827', 860.00),
(3, 'Плитка настенная Цветок 60x120 см цвет зелено-голубой', '8559898', 2300.00),
(2, 'Пробковое настенное покрытие 600х300х3 мм белый', '7259474', 3300.00),
(3, 'Плитка настенная Нева 30x60 см цвет серый', '8115947', 1700.00),
(4, 'Гипсовая плитка настенная Дом на берегу кирпич белый 18,5х4,5 см', '5033136', 499.00),
(5, 'Ламинат Дуб Северный белый 32 класс толщина 8 мм с фаской', '9028048', 2550.00),
(1, 'Дерево волокнистая плита Дуб Винтаж 1200х620х3 мм светло-коричневый', '6123459', 900.50);


INSERT INTO partners (
    partner_type,
    partner_name,
    partner_director,
    partner_email,
    partner_phone,
    partner_legal_address,
    partner_inn,
    partner_rating
) VALUES
('ЗАО', 'Стройдвор', 'Андреева Ангелина Николаевна', 'angelina77@kart.ru', '492 452 22 82', '143001, Московская область, город Одинцово, уд. Ленина, 21', '9432455179', 5),
('ЗАО', 'Самоделка', 'Мельников Максим Петрович', 'melnikov.maksim88@hm.ru', '812 267 19 59', '306230, Курская область, город Обоянь, ул. 1 Мая, 89', '7803888520', 3),
('ООО', 'Деревянные изделия', 'Лазарев Алексей Сергеевич', 'aleksejlazarev@al.ru', '922 467 93 83', '238340, Калининградская область, город Светлый, ул. Морская, 12', '8430391035', 4),
('ООО', 'Декор и отделка', 'Саншокова Мадина Муратовна', 'mmsanshokova@lss.ru', '413 230 30 79', '685000, Магаданская область, город Магадан, ул. Горького, 15', '4318170454', 7),
('ООО', 'Паркет', 'Иванов Дмитрий Сергеевич', 'ivanov.dmitrij@mail.ru', '921 851 21 22', '606440, Нижегородская область, город Бор, ул. Свободы, 3', '7687851800', 7),
('ПАО', 'Дом и сад', 'Аникеева Екатерина Алексеевна', 'ekaterina.anikeeva@ml.ru', '499 936 29 26', '393760, Тамбовская область, город Мичуринск, ул. Красная, 50', '6119144874', 7),
('ОАО', 'Легкий шаг', 'Богданова Ксения Владимировна', 'bogdanova.kseniya@bkv.ru', '495 445 61 41', '307370, Курская область, город Рыльск, ул. Гагарина, 16', '1122170258', 6),
('ПАО', 'СтройМатериалы', 'Холодова Валерия Борисовна', 'holodova@education.ru', '499 234 56 78', '140300, Московская область, город Егорьевск, ул. Советская, 24', '8355114917', 5),
('ОАО', 'Мир отделки', 'Крылов Савелий Тимофеевич', 'stkrylov@mail.ru', '908 713 51 88', '344116, Ростовская область, город Ростов-на-Дону, ул. Артиллерийская, 4', '3532367439', 8),
('ОАО', 'Технологии комфорта', 'Белов Кирилл Александрович', 'kirill_belov@kir.ru', '918 432 12 34', '164500, Архангельская область, город Северодвинск, ул. Ломоносова, 29', '2362431140', 4),
('ПАО', 'Твой дом', 'Демидов Дмитрий Александрович', 'dademidov@ml.ru', '919 698 75 43', '354000, Краснодарский край, город Сочи, ул. Больничная, 11', '4159215346', 10),
('ЗАО', 'Новые краски', 'Алиев Дамир Игоревич', 'alievdamir@tk.ru', '812 823 93 42', '187556, Ленинградская область, город Тихвин, ул. Гоголя, 18', '9032455179', 9),
('ОАО', 'Политехник', 'Котов Михаил Михайлович', 'mmkotov56@educat.ru', '495 895 71 77', '143960, Московская область, город Реутов, ул. Новая, 55', '3776671267', 5),
('ОАО', 'СтройАрсенал', 'Семенов Дмитрий Максимович', 'semenov.dm@mail.ru', '896 123 45 56', '242611, Брянская область, город Фокино, ул. Фокино, 23', '7447864518', 5),
('ПАО', 'Декор и порядок', 'Болотов Артем Игоревич', 'artembolotov@ab.ru', '950 234 12 12', '309500, Белгородская область, город Старый Оскол, ул. Цветочная, 20', '9037040523', 5),
('ПАО', 'Умные решения', 'Воронова Анастасия Валерьевна', 'voronova_anastasiya@mail.ru', '923 233 27 69', '652050, Кемеровская область, город Юрга, ул. Мира, 42', '6221520857', 3),
('ЗАО', 'Натуральные покрытия', 'Горбунов Василий Петрович', 'vpgorbunov24@vvs.ru', '902 688 28 96', '188300, Ленинградская область, город Гатчина, пр. 25 Октября, 17', '2262431140', 9),
('ООО', 'СтройМастер', 'Смирнов Иван Андреевич', 'smirnov_ivan@kv.ru', '917 234 75 55', '184250, Мурманская область, город Кировск, пр. Ленина, 24', '4155215346', 9),
('ООО', 'Гранит', 'Джумаев Ахмед Умарович', 'dzhumaev.ahmed@amail.ru', '495 452 55 95', '162390, Вологодская область, город Великий Устюг, ул. Железнодорожная, 36', '3961234561', 5),
('ЗАО', 'Строитель', 'Петров Николай Тимофеевич', 'petrov.nikolaj31@mail.ru', '916 596 15 55', '188910, Ленинградская область, город Приморск, ш. Приморское, 18', '9600275878', 10);


INSERT INTO sales (sale_product_name_id, sale_partner_name_id, sale_quantity)
VALUES


(4, 1, 2000),
(5, 2, 3000),
(1, 3, 1000),
(3, 4, 9500),
(1, 5, 2000),
(16, 6, 1100),
(9, 7, 5000),
(1, 8, 2500),
(2, 9, 6000),
(7, 10, 7000),
(4, 11, 5000),
(4, 12, 7500),
(1, 13, 3000),
(16, 14, 500),
(15, 15, 7000),
(9, 16, 4000),
(1, 17, 3500),
(1, 18, 7900),
(13, 19, 9600),
(13, 20, 1200),
(11, 1, 1500),
(5, 2, 3000),
(2, 3, 3010),
(3, 4, 3020),
(5, 5, 3050),
(14, 6, 3040),
(5, 7, 3050),
(4, 8, 3060),
(16, 9, 3070),
(9, 10, 5400),
(9, 11, 5500),
(11, 12, 5600),
(9, 13, 5700),
(14, 14, 5800),
(2, 15, 5900),
(9, 16, 6000),
(7, 17, 6100),
(9, 18, 8000),
(3, 19, 7060),
(13, 20, 6120),
(13, 1, 5180),
(5, 2, 4240),
(5, 3, 3300),
(5, 4, 2360),
(5, 5, 1420),
(11, 6, 1500),
(5, 7, 1700),
(9, 8, 1900),
(13, 9, 2100),
(9, 10, 2300),
(5, 11, 2500),
(9, 12, 2700),
(1, 13, 3100),
(16, 15, 3300),
(5, 16, 3500),
(5, 17, 3750),
(14, 18, 6700),
(3, 19, 6950),
(11, 20, 7200),
(13, 1, 7450),
(5, 2, 7700),
(19, 3, 7950),
(5, 4, 8200),
(3, 5, 8450),
(3, 6, 8700),
(5, 7, 8950),
(19, 8, 9200),
(4, 9, 1300),
(15, 10, 1500),
(15, 11, 1700),
(9, 12, 1900),
(19, 13, 2100),
(9, 14, 2300),
(2, 15, 2500),
(19, 16, 2700),
(1, 17, 3100),
(16, 15, 3300),
(5, 16, 3500),
(3, 17, 6950),
(11, 18, 7200),
(5, 19, 7450),
(5, 20, 7700),
(19, 3, 7950),
(5, 4, 8200),
(3, 5, 8450),
(3, 6, 8700),
(5, 7, 8950),
(19, 8, 9200);
